src/main/resources/xml/accommodationSalesServicePort/retrieveSummary/retrieveSummary.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:retrieveSummary>
         <request>
            <retrieveTaxExempt>?</retrieveTaxExempt>
            <!--Zero or more repetitions:-->
            <travelComponentGroupingIds>?</travelComponentGroupingIds>
            <!--Zero or more repetitions:-->
            <travelComponentIds>?</travelComponentIds>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:retrieveSummary>
   </soapenv:Body>
</soapenv:Envelope>
